# Pandas ====> its an open source library that is used for handle data manipulation

In [1]:
#data structure
# 1) Series 2) Dataframe

In [2]:
import pandas as pd

# 2)Series

In [3]:
a=pd.Series([1,2,34,45])
a

0     1
1     2
2    34
3    45
dtype: int64

In [5]:
type(a)

pandas.core.series.Series

# 3) DataFrame

In [63]:
a={
    "Emp ID" : [1,2,3,4,5,6,7,8],
    "Name" : ['a','sourav','karan','gourav','sahil','puneet','sohail','aman'],
    "Department" : ['IT','HR','Manager','HR','IT','HR','IT','HR'],
    "Working_Hours" : [4,5,6,7,5,4,6,7]
}

In [64]:
type(a)

dict

In [65]:
df=pd.DataFrame(a)
df

   Emp ID    Name Department  Working_Hours
0       1       a         IT              4
1       2  sourav         HR              5
2       3   karan    Manager              6
3       4  gourav         HR              7
4       5   sahil         IT              5
5       6  puneet         HR              4
6       7  sohail         IT              6
7       8    aman         HR              7

In [66]:
df.columns

Index(['Emp ID', 'Name', 'Department', 'Working_Hours'], dtype='object')

In [67]:
df.head() #give top 5 by default

   Emp ID    Name Department  Working_Hours
0       1       a         IT              4
1       2  sourav         HR              5
2       3   karan    Manager              6
3       4  gourav         HR              7
4       5   sahil         IT              5

In [68]:
df.head(2)

   Emp ID    Name Department  Working_Hours
0       1       a         IT              4
1       2  sourav         HR              5

In [69]:
df.tail() #give last 5 by default

   Emp ID    Name Department  Working_Hours
3       4  gourav         HR              7
4       5   sahil         IT              5
5       6  puneet         HR              4
6       7  sohail         IT              6
7       8    aman         HR              7

In [70]:
df.tail(2)

   Emp ID    Name Department  Working_Hours
6       7  sohail         IT              6
7       8    aman         HR              7

In [71]:
df.sample()

   Emp ID  Name Department  Working_Hours
7       8  aman         HR              7

In [72]:
df.sample(4)

   Emp ID    Name Department  Working_Hours
3       4  gourav         HR              7
0       1       a         IT              4
7       8    aman         HR              7
1       2  sourav         HR              5

In [73]:
df.describe() # if yoy want statically view of data

        Emp ID  Working_Hours
count  8.00000       8.000000
mean   4.50000       5.500000
std    2.44949       1.195229
min    1.00000       4.000000
25%    2.75000       4.750000
50%    4.50000       5.500000
75%    6.25000       6.250000
max    8.00000       7.000000

In [74]:
df.info()  #complete overview of data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Emp ID         8 non-null      int64
 1   Name           8 non-null      object
 2   Department     8 non-null      object
 3   Working_Hours  8 non-null      int64
dtypes: int64(2), object(2)
memory usage: 388.0+ bytes

In [75]:
df.to_csv("C:\\Users\\YASH\\OneDrive\\Desktop\\ty\\Emp_info.csv")

In [76]:
df.to_csv("C:\\Users\\YASH\\OneDrive\\Desktop\\ty\\New_Emp_info.csv",index=False) #index false removes the extra column which is created by default

In [77]:
df.to_excel("C:\\Users\\YASH\\OneDrive\\Desktop\\ty\\Old_Emp_info.xlsx")

# How to read csv file into jupyter notebook

In [78]:
df=pd.read_csv("C:\\Users\\YASH\\OneDrive\\Desktop\\ty\\Emp_info.csv")

In [79]:
df.head()

   Unnamed: 0  Emp ID    Name Department  Working_Hours
0           0       1       a         IT              4
1           1       2  sourav         HR              5
2           2       3   karan    Manager              6
3           3       4  gourav         HR              7
4           4       5   sahil         IT              5

In [80]:
df['Department'] #all data

0         IT
1         HR
2    Manager
3         HR
4         IT
5         HR
6         IT
7         HR
Name: Department, dtype: object

In [81]:
df['Department'].value_counts() #data count

Department
HR         4
IT         3
Manager    1
Name: count, dtype: int64

# make changes in data

In [82]:
df['Name'][0]='Aryan'

C:\Users\YASH\AppData\Local\Temp\ipykernel_22172\3347344655.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][0]='Aryan'

In [83]:
df.head()

   Unnamed: 0  Emp ID    Name Department  Working_Hours
0           0       1   Aryan         IT              4
1           1       2  sourav         HR              5
2           2       3   karan    Manager              6
3           3       4  gourav         HR              7
4           4       5   sahil         IT              5

In [84]:
df['Working_Hours'][2]=100

C:\Users\YASH\AppData\Local\Temp\ipykernel_22172\3355893650.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Working_Hours'][2]=100

In [85]:
df.head()

   Unnamed: 0  Emp ID    Name Department  Working_Hours
0           0       1   Aryan         IT              4
1           1       2  sourav         HR              5
2           2       3   karan    Manager            100
3           3       4  gourav         HR              7
4           4       5   sahil         IT              5

In [86]:
# loc and iloc

# df.loc("row_range","column_name")
# df.iloc("row_range","column_range")

In [87]:
df.loc[2:3]

   Unnamed: 0  Emp ID    Name Department  Working_Hours
2           2       3   karan    Manager            100
3           3       4  gourav         HR              7

In [88]:
df.loc[2:3,["Name","Department"]]

     Name Department
2   karan    Manager
3  gourav         HR

In [89]:
df.iloc[2:3]

   Unnamed: 0  Emp ID   Name Department  Working_Hours
2           2       3  karan    Manager            100

In [90]:
df.iloc[2:3,1:3]

   Emp ID   Name
2       3  karan

In [91]:
df['Name'][2]=None  #giving some value None

C:\Users\YASH\AppData\Local\Temp\ipykernel_22172\2487297997.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][2]=None

In [92]:
df['Department'][3]=None
df['Department'][4]=None

C:\Users\YASH\AppData\Local\Temp\ipykernel_22172\1668653274.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Department'][3]=None
C:\Users\YASH\AppData\Local\Temp\ipykernel_22172\1668653274.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Department'][4]=None

In [93]:
df

   Unnamed: 0  Emp ID    Name Department  Working_Hours
0           0       1   Aryan         IT              4
1           1       2  sourav         HR              5
2           2       3    None    Manager            100
3           3       4  gourav       None              7
4           4       5   sahil       None              5
5           5       6  puneet         HR              4
6           6       7  sohail         IT              6
7           7       8    aman         HR              7

In [94]:
df.isnull()  #true is there where value is none

   Unnamed: 0  Emp ID   Name  Department  Working_Hours
0       False   False  False       False          False
1       False   False  False       False          False
2       False   False   True       False          False
3       False   False  False        True          False
4       False   False  False        True          False
5       False   False  False       False          False
6       False   False  False       False          False
7       False   False  False       False          False

In [95]:
df.isnull().sum() #sum of total no. of none value

Unnamed: 0       0
Emp ID           0
Name             1
Department       2
Working_Hours    0
dtype: int64

In [97]:
df.dropna()  #this drops the null value from database

   Unnamed: 0  Emp ID    Name Department  Working_Hours
0           0       1   Aryan         IT              4
1           1       2  sourav         HR              5
5           5       6  puneet         HR              4
6           6       7  sohail         IT              6
7           7       8    aman         HR              7